Revit 2027 API
MacroModule.ModuleFolder Property
 The module folder.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ModuleFolder { get; }
Public ReadOnly Property ModuleFolder As String
	Get
public:
property String^ ModuleFolder {
	String^ get ();
}
member ModuleFolder : string with get
Property Value
String
See Also
Reference
MacroModule Class
Autodesk.Revit.DB.Macros Namespace